# Métodos

In [1]:
import pandas as pd

In [3]:
# Creamos un dataframe a partir de un diccionario:
# Diccionario:
datos_personas = {
    'Ana':{ 'Altura (cm)': 160, 'Peso (kg)': 55},
    'Carlos':{ 'Altura (cm)': 175, 'Peso (kg)': 70},
    'María':{ 'Altura (cm)': 162, 'Peso (kg)': 60}}

# Dataframe:
personas = pd.DataFrame(datos_personas)
personas

             Ana  Carlos  María
Altura (cm)  160     175    162
Peso (kg)     55      70     60

# df.add()

In [5]:
# Suma:
personas_add = personas.add(1)
personas_add

             Ana  Carlos  María
Altura (cm)  161     176    163
Peso (kg)     56      71     61

# df.sub()

In [6]:
# Resta:
personas_sub = personas.sub(5)
personas_sub

             Ana  Carlos  María
Altura (cm)  155     170    157
Peso (kg)     50      65     55

# df.mul()

In [7]:
# Multiplicación:
personas_mul = personas.mul(2)
personas_mul

             Ana  Carlos  María
Altura (cm)  320     350    324
Peso (kg)    110     140    120

# df.div()

In [8]:
# División, devuelve un float:
personas_div = personas.div(9)
personas_div

                   Ana     Carlos      María
Altura (cm)  17.777778  19.444444  18.000000
Peso (kg)     6.111111   7.777778   6.666667

# df.floordiv()

In [9]:
# División entera, devuelve un entero:
personas_floordiv = personas.floordiv(9)
personas_floordiv

             Ana  Carlos  María
Altura (cm)   17      19     18
Peso (kg)      6       7      6

# df.mod()

In [10]:
# Módulo o Resto:
personas_mod = personas.mod(9)
personas_mod

             Ana  Carlos  María
Altura (cm)    7       4      0
Peso (kg)      1       7      6

# df.pow()

In [11]:
# Potencia:
personas_pow = personas.pow(2)
personas_pow

               Ana  Carlos  María
Altura (cm)  25600   30625  26244
Peso (kg)     3025    4900   3600